<a href="https://colab.research.google.com/github/jwhthebank/12161494DB/blob/main/12161494_JeonWoohyeok_Midterm_Assigment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Import SQL**

In [9]:
import sqlite3
print(sqlite3.version)
conn = sqlite3.connect('ITSMidtermv2.db')
print(type(conn))
print(sqlite3.Connection)

cur = conn.cursor()

2.6.0
<class 'sqlite3.Connection'>
<class 'sqlite3.Connection'>

# **Create Table**

In [10]:
# Create Table
cur.execute("""
CREATE TABLE [Country]
( 
	[Country_Code]       varchar(50) NOT NULL ,
	[Name]               varchar(50)  NOT NULL ,
	[Language]           varchar(50)  NOT NULL 
)
""")

cur.execute("""
CREATE TABLE [Driver]
( 
	[License_Number]     varchar(50) NOT NULL ,
	[Name]               varchar(50)  NOT NULL ,
	[Language]           varchar(50)  NOT NULL ,
	[Clearance_Level]    integer  NOT NULL 
  	CONSTRAINT [1_4]
		CHECK  ( Clearance_Level BETWEEN 1 AND 4 ), 
	[Additive_License]   varchar(50)  NULL 
)
""")

# Resolution Table for M:M relation Driver_Driving_Data to Drivier_Officer
cur.execute("""
CREATE TABLE [Driver_Driving_Data]
( 
	[License_Number]     varchar(50)  NOT NULL ,
	[Reference_Code]     varchar(50)  NOT NULL 
)
""")

cur.execute("""
CREATE TABLE [Driver_Officer]
( 
	[License_Number]     varchar(50)  NOT NULL ,
	[Officer_Id]         varchar(50)  NOT NULL 
)
""")

cur.execute("""
CREATE TABLE [Driving_Data]
( 
	[Reference_Code]     varchar(50) NOT NULL ,
	[Pickup_Location_Name] varchar(50)  NULL ,
	[Dropoff_Location_Name] varchar(50)  NULL ,
	[Acutal_Start_Date_time] DATETIME  NULL ,
	[Acutal_End_Date_time] DATETIME  NULL ,
	[Odometer_Start_Date_time] DATETIME  NULL ,
	[Odometer_End_Date_time] DATETIME  NULL 
)
""")

cur.execute("""
CREATE TABLE [FATL]
( 
	[FATL_Number]        integer  NOT NULL ,
	[Level]              integer  NOT NULL 
	CONSTRAINT [1_10]
		CHECK  ( Level BETWEEN 1 AND 10 ),
	[Qualification_Date] DATE  NOT NULL 
)
""")

cur.execute("""
CREATE TABLE [Incheon]
( 
	[Location_Name]      varchar(50) NOT NULL ,
	[Type]               varchar(50)  NULL ,
	[Address]            varchar(50)  NOT NULL 
)
""")

cur.execute("""
CREATE TABLE [Officer]
( 
	[Officer_Id]         varchar(50)  NOT NULL ,
	[Name]               varchar(50)  NOT NULL ,
	[Role]               varchar(50)  NOT NULL ,
	[Model]              varchar(50)  NOT NULL ,
	[Country_Code]       varchar(50)  NOT NULL ,
	[Language]           varchar(50)  NOT NULL 
)
""")

cur.execute("""
CREATE TABLE [Order]
( 
	[Action_Type]        varchar(50)  NULL ,
	[Order_Date]         DATETIME  NULL ,
	[Final_Cost]         varchar(50)  NULL ,
	[Final_Odometer]     integer  NULL ,
	[Description]        varchar(50)  NULL ,
	[End_Date]           DATETIME  NULL 
)
""")

cur.execute("""
CREATE TABLE [STLVT]
( 
	[STLVT_Number]       integer  NOT NULL ,
	[Level]              integer  NOT NULL 
	CONSTRAINT [1_5]
		CHECK  ( Level BETWEEN 1 AND 5 ),
	[Qualification_Date] DATE  NOT NULL ,
	[Authorizing_Agency] varchar(50)  NOT NULL 
)
""")

cur.execute("""
CREATE TABLE [Vehicle]
( 
	[Vehicle_Id]         varchar(50)  NOT NULL ,
	[Registration_Id]    varchar(50)  NULL ,
	[Status]             varchar(50)  NULL ,
	[Manufacturer]              varchar(50)  NULL ,
	[Model]              varchar(50)  NULL ,
	[Color]       varchar(50)  NULL ,
	[Current_Odometer]   integer  NULL ,
	[Passenger_Capacity] integer  NULL 
)
""")

conn.commit()

# **Insert Data**

In [11]:
#Insert Data to Vehicle Table
cur.execute("""INSERT INTO Vehicle VALUES('V1000', '2001 ABC','Y','Volvo','XC90 SE','Silver',4350,4)""")
cur.execute("""INSERT INTO Vehicle VALUES('V1001', '2006 AFD','Y','Kia','K7','Black',2195,4)""")
cur.execute("""INSERT INTO Vehicle VALUES('V1002', '2021 AHR','N','Tesla','2020 F','White',509,2)""")
cur.execute("""INSERT INTO Vehicle VALUES('V1003', '2020 DXF','Y','Ford','Transit','Silver',974,2)""")

conn.commit()

In [17]:
#Insert Data to County Table by National Code 3 digits, Lauguage code ISO 3611
cur.execute("""INSERT INTO Country VALUES('410','Korea','KR')""") 
cur.execute("""INSERT INTO Country VALUES('840','USA','EN')""") 
conn.commit()

In [19]:
#Insert Data to Driver Table
cur.execute("""INSERT INTO Driver VALUES('15-32-23333','KIM MINSU','KR,EN','4','FATL')""")
cur.execute("""INSERT INTO Driver VALUES('10-15-13453','KIM CHEOLSU','KR','2','FATL,STLVT')""")

conn.commit()

In [23]:
#Insert Data to Driving Data Table
cur.execute("""INSERT INTO Driving_Data VALUES('2D122','Michuhol 123-11','Bupyeong 111-22','2022-05-30 16:22','2022-05-30 17:52','2022-05-30 16:22','2022-05-30 17:52')""")
cur.execute("""INSERT INTO Driving_Data VALUES('3D001','Songdo 222-12','Geyang 569-33','2022-05-28 17:22','2022-05-30 18:30','2022-05-29 15:22','2022-05-30 16:52')""")

conn.commit()

In [25]:
#Insert Data to FATL Table
cur.execute("""INSERT INTO FATL VALUES('FATL-10122','3','2022-03-11')""")
cur.execute("""INSERT INTO FATL VALUES('FATL-10222','4','2022-03-11')""")

conn.commit()

In [26]:
#Insert Data to STLVT Table
cur.execute("""INSERT INTO STLVT VALUES('STLVT-10112','3','2022-03-11','Michuhol Police Station')""")
cur.execute("""INSERT INTO STLVT VALUES('STLVT-10212','5','2022-03-21','Foreign Ambassy')""")

conn.commit()

In [27]:
#Insert Data to Incheon Table
cur.execute("""INSERT INTO Incheon VALUES('Michuhol 123-11', 'Hotel','100, Inha-ro, Michuhol-gu, Incheon, Republic of Korea')""")
cur.execute("""INSERT INTO Incheon VALUES('Songdo 222-12', 'Stadium','20, Songdogyoyuk-ro, Yeonsu-gu, Incheon, Republic of Korea')""")

conn.commit()

In [28]:
#Insert Data to Officer Table
cur.execute("""INSERT INTO Officer VALUES('10-00-2222','James Bond','Referee','XC90 SE','840','EN')""")
cur.execute("""INSERT INTO Officer VALUES('21-00-4422','YUNA PARK','Referee','K7','410','KR')""")

conn.commit()

# **Show Data**

In [42]:
import pandas as pd

cur.execute("SELECT * FROM Vehicle")

rows = cur.fetchall()

columns = [column[0] for column in cur.description]

frame = pd.DataFrame.from_records(data=rows, columns=columns)

conn.close()

frame

,Vehicle_Id,Registration_Id,Status,Manufacturer,Model,Color,Current_Odometer,Passenger_Capacity
0,V1000,2001 ABC,Y,Volvo,XC90 SE,Silver,4350,4
1,V1001,2006 AFD,Y,Kia,K7,Black,2195,4
2,V1002,2021 AHR,N,Tesla,2020 F,White,509,2
3,V1003,2020 DXF,Y,Ford,Transit,Silver,974,2

In [ ]:
# DB Connection Closing
conn.close()